Revit 2027 API
UIView.ZoomAndCenterRectangle Method
 Zoom and center the view to a specified rectangle.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ZoomAndCenterRectangle(
	XYZ viewCorner1,
	XYZ viewCorner2
)
Public Sub ZoomAndCenterRectangle (
	viewCorner1 As XYZ,
	viewCorner2 As XYZ
)
public:
void ZoomAndCenterRectangle(
	XYZ^ viewCorner1,
	XYZ^ viewCorner2
)
member ZoomAndCenterRectangle :
        viewCorner1 : XYZ *
        viewCorner2 : XYZ -> unit
Parameters
viewCorner1 XYZ
 A corner of the desired view rectangle in model coordinates.
viewCorner2 XYZ
 The opposite corner of the desired view rectangle in model coordinates.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
UIView Class
Autodesk.Revit.UI Namespace